#include <iostream>

using std::cout;
using std::cin;
using std::endl;

/*
점 (x, y, z) 데이터 값을 저장하는 리스트를 만든다. (점 데이터는 각각 정수이고, 구조체를 사용하도록 한다.)

• 최대 10개의 점 데이터를 저장하도록 한다.
• 리스트에 데이터를 입력하거나 삭제하고 출력하는 명령어를 실행한다.
• 각 명령어를 입력 받으면 결과 리스트를 다음페이지의 그림과 같이 항상 10개의 항목을 가진 리스트로 (인덱스와 데이터 값) 출력한다.

• 구현 함수 프로토타입과 명령어:
• + x y z: 리스트의 맨 위에 입력 (x, y, z: 숫자)
• -: 리스트의 맨 위에서 삭제한다.
• e x y z: 리스트의 맨 아래에 입력 (명령어 +와 반대의 위치, 리스트에 저장된 데이터값이 위로 올라간다.)
• d: 리스트의 맨 아래에서 삭제한다. (리스트에서 삭제된 칸이 비어있다.)
• l: 리스트에 저장된 점의 개수를 출력한다.
• c: 리스트를 비운다. 리스트를 비운 후 다시 입력하면 0번부터 저장된다.
• m: 원점에서 가장 먼 거리에 있는 점의 좌표값을 출력한다.
• n: 원점에서 가장 가까운 거리에 있는 점의 좌표값을 출력한다.
• a: 원점과의 거리를 정렬하여 오름차순으로 정렬하여 출력한다. 인덱스 0번부터 빈 칸없이 저장하여 출력한다.
• s: 원점과의 거리를 정렬하여 내림차순으로 정렬하여 출력한다. (다시 a 또는 s를 누르면 원래의 인덱스 위치에 출력한다.)
• q: 프로그램을 종료한다
*/

int main()
{

}